Repository: adamsat2/CurbIt
Catalog: CurbIt/Resources/Localizable.xcstrings
Source language: en
Languages: he

source: Add Your First Goal
he: הוסף/פי את המטרה הראשונה שלך

source: All goals completed
he: כל המטרות הושגו

source: Almost there! Just a few more saves to reach your target.
he: כמעט שם! עוד כמה חסכנות והגעת ליעד.

source: Amount Saved
he: סכום שחסכת

source: Any unsaved changes will be lost.
he: כל השינויים הלא שמורים יאבדו.

source: Are you sure you want to delete "%@"? All logged resisted impulses for this goal will be removed.
he: האם את/ה בטוח/ה שאת/ה רוצה למחוק את “%@”? כל הדחפים שדחית עבור המטרה הזאת ימחקו.

# Awesome! Resisting %@ just completed your goal: %@!
source: Awesome! Resisting %1$@ just completed your goal: %2$@!
he: מעולה! המנעות מ- %1$@ עזרה לך להגיע למטרה שלך: %2$@!

source: Building strong momentum. Keep eyes fixed on the vision!
he: את/ה על מומנטום חזק. המשך/כי להתרכז במטרה!

source: Cancel
he: ביטול

source: Changing the currency symbol only updates how amounts are formatted. It does not convert or recalculate existing numbers.
he: שינוי המטבע רק יעדכן את הסמל. הוא לא ימיר את הסכומים או יחשב אותם מחדש.

source: COMPLETED
he: הסתיים

source: Confirm
he: אישור

source: Contribute to Goal
he: הוספה למטרה

source: Create Goal
he: יצירת מטרה

source: CURRENCY
he: מטבע

source: Currency: USD ($)
he: מטבע: USD ($)

source: Define your goal
he: הגדר/י את המטרה שלך

source: Delete
he: מחיקה

source: Delete Goal
he: מחק/י מטרה

source: Discard
he: מחיקה

source: Discard Changes?
he: מחק שינויים?

source: Due: %@
he: עד לתאריך: %@

source: Edit
he: עריכת פרטים

source: Edit Goal
he: עריכת פרטי המטרה

source: Edit Impulse
he: עריכת פרטי הדחף

source: Edit Resisted Impulse
he: עריכת פרטי הדחף שנבלם

source: Enter your name
he: הכנס/י את שמך

source: Final stretch! Just a couple more saves to cross the line.
he: מאמץ אחרון! רק עוד כמה חסכונות להשגת המטרה.

source: First step taken. The hardest part of restraint is starting.
he: הצעד הראשון בוצע. החלק הכי קשה באיפוק הוא ההתחלה.

source: Get Started
he: בואו נתחיל

source: Goal
he: מטרה

source: Goal Completed!
he: מטרה הושגה!

source: Goal Name (e.g., Vacation to Rome)
he: שם המטרה (לדוגמא, חופשה לרומא)

source: Goal: %@
he: המטרה: %@

source: Good afternoon, %@
he: צהריים טובים, %@

source: Good evening, %@
he: ערב טוב, %@

source: Good morning, %@
he: בוקר טוב, %@

source: Good night, %@
he: לילה טוב, %@

source: Great start! Every impulse resisted brings you closer to your goal.
he: התחלה טובה! כל דחף שנבלם מביא אותך קרוב יותר למטרה שלך.

source: Halfway mark in sight. Your daily discipline is paying off!
he: כמעט הגעת לחצי. המשמעת שלך משתלמת!

source: Item Resisted
he: הדחף שדחית

source: Keep Editing
he: המשך בעריכת שינויים

source: Let's set up your profile.
he: בוא/י נתחיל ביצירת הפרופיל שלך.

source: Log Impulse
he: תיעוד דחף

source: Log Resisted Impulse
he: תיעוד דחף שנבלם

# Logged %@ for %@.
source: Logged %1$@ for %2$@.
he: %1$@ תועד עבור %2$@.

source: New Goal
he: מטרה חדשה

source: New Impulse
he: דחף חדש

source: No goals yet. Create a new one to start curbing your impulses.
he: אין עדיין מטרות. צור מטרה חדשה על מנת להתחיל לרסן את הדחפים שלך.

source: No resisted impulses logged yet. Every resisted purchase brings you closer to your goal.
he: אין דחפים שנבלמו עדיין. כל קנייה שנבלמה מביאה אותך קרוב יותר למטרה שלך.

source: Overdue: %@
he: היה עד לתאריך: %@

source: Record a resisted purchase to save money for your goal.
he: תעד/י קנייה ממנה נמנעת בשביל לחסוך כסף עבור המטרה שלך.

source: RESISTED PURCHASES
he: קניות שרוסנו

source: Save Changes
he: שמור שינויים

source: Save Impulse
he: שמור דחף

source: Save Settings
he: שמור הגדרות

source: Seed planted. Small resists lead to major rewards.
he: התחלת לחסוך. התנגדויות קטנות מובילות לתגמולים משמעותיים.

source: Select a Goal
he: בחר/י מטרה

source: Select Currency
he: בחר/י מטבע

source: Set Due Date
he: הגדר/י תאריך יעד

source: Settings
he: הגדרות

source: Target Amount (%@)
he: סכום יעד (%@)

source: Target Goal
he: מטרת היעד

source: The finish line is right here. Stay focused on the prize.
he: קו הסיום קרוב. הישאר/י מפוקס/ת.

source: TOTAL SAVED
he: סה״כ חסכת

source: Update goal details
he: עדכון פרטי המטרה

source: Update Impulse
he: עדכון הדחף

source: Used with Apple Intelligence to create milestone motivation. Requires supported devices, enabled state, and an English locale.
he: משתמש ב-Apple Intelligence בשביל ליצור משפטי מוטיבציה להשגת המטרה. דורש מכשיר שתומך, הפעלה של AI ועובד רק בשפה האנגלית.

source: Visual Currency Change
he: שינוי מטבע ויזואלי

source: Welcome to CurbIt
he: ברוכים הבאים לקארב-איט

source: What did you resist? (e.g., Takeout coffee)
he: לאיזה דחף התנגדת? (לדוגמא, קניית קפה בחוץ)

source: Which goal should we add this to?
he: לאיזו מטרה להוסיף את זה?

source: You don't have any active goals to contribute to.
he: אין לך שום מטרה פעילה לתרום לה.

source: You successfully saved enough for %@. Great job!
he: עבודה מעולה! חסכת בהצלחה מספיק כסף עבור %@.

source: You're making steady progress. Keep going, you're on the right track!
he: את/ה מתקדם/מת בהתמדה. המשך/כי כך, את/ה בדרך הנכונה!

source: YOUR NAME
he: השם שלך
